Revit 2024 API
BuiltInFailures.EditingFailures.HaveNoPermissionToEdit Property
 You do not have permission to edit the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId HaveNoPermissionToEdit { get; }
Visual Basic
Public Shared ReadOnly Property HaveNoPermissionToEdit As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ HaveNoPermissionToEdit {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace